import { KeyEvent } from './types';

export const events: KeyEvent[] = [
  {
    id: 1,
    intervalId: 3,
    year: 2015,
    text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
  },
  {
    id: 2,
    year: 2016,
    intervalId: 3,
    text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
  },
  {
    id: 3,
    year: 2017,
    intervalId: 3,
    text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
  },
  {
    id: 4,
    intervalId: 1,
    year: 1992,
    text: 'Нобелевская премия по литературе — Дерек Уолкотт, за блестящий образец карибского эпоса в 64 разделах.',
  },
  {
    id: 5,
    intervalId: 1,
    year: 1993,
    text: 'Нобелевская премия по литературе — Тони Моррисон, первая афроамериканка, удостоенная премии. За проникновенное изображение афроамериканского опыта.',
  },
  {
    id: 6,
    intervalId: 1,
    year: 1994,
    text: 'Бессоница — роман Стивена Кинга, психологический триллер с элементами фэнтези, исследующий влияние потери сна на восприятие реальности.',
  },
  {
    id: 7,
    intervalId: 1,
    year: 1994,
    text: 'Нобелевская премия по литературе — Кэндзабуро Оэ, за поэтическую силу, создающую мир, в котором жизнь и миф сливаются в тревожное единство.',
  },
  {
    id: 8,
    intervalId: 1,
    year: 1995,
    text: 'Нобелевская премия по литературе — Шеймас Хини, за одухотворённую поэзию, в которой повседневное возводится до исторического масштаба.',
  },
  {
    id: 9,
    intervalId: 1,
    year: 1996,
    text: 'Нобелевская премия по литературе — Вислава Шимборска, за поэзию, которая с иронической точностью раскрывает контексты исторической и биологической реальности.',
  },
  {
    id: 10,
    intervalId: 1,
    year: 1997,
    text: 'Джоан Роулинг — «Гарри Поттер и философский камень», выход первой книги в культовой серии, ставшей глобальным феноменом.',
  },
  {
    id: 11,
    intervalId: 2,
    year: 1987,
    text: '«Робокоп», США (реж. Пол Верховен)',
  },
  {
    id: 12,
    intervalId: 2,
    year: 1988,
    text: '«Бегущий по лезвию», США (реж. Ридли Скотт)',
  },
  {
    id: 13,
    intervalId: 2,
    year: 1989,
    text: '«Бэтмен», США (реж. Тим Бертон)',
  },
  {
    id: 14,
    intervalId: 2,
    year: 1990,
    text: '«Молчание ягнят», США (реж. Джонатан Демме)',
  },
  {
    id: 15,
    intervalId: 2,
    year: 1991,
    text: '«Терминатор 2: Судный день», США (реж. Джеймс Кэмерон)',
  },
];
